In [1]:
import pandas as pd
import numpy as np

# Define the number of samples
num_samples = 200

# Create a list of neighborhood options
neighborhoods = ['East', 'West', 'North', 'South']

# Create a dictionary to store data
data = {
    'Home': [f'Home {i}' for i in range(1, num_samples + 1)],
    'Price': np.random.randint(150000, 800000, size=num_samples),
    'SqFt': np.random.randint(1000, 4000, size=num_samples),
    'Bedrooms': np.random.randint(2, 6, size=num_samples),
    'Bathrooms': np.random.randint(1, 4, size=num_samples),
    'Offers': np.random.randint(0, 5, size=num_samples),
    'Brick': np.random.choice([0, 1], size=num_samples),  # 0 for no brick, 1 for brick
    'Neighborhood': np.random.choice(neighborhoods, size=num_samples),
    'Churn': np.random.choice([0, 1], size=num_samples)  # 0 for not churned, 1 for churned
}

# Introduce duplicate values
for _ in range(5):
    idx = np.random.randint(0, num_samples)
    data['Price'][idx] = data['Price'][idx - 1]
    data['SqFt'][idx] = data['SqFt'][idx - 1]

# Introduce outliers
outlier_idx = np.random.choice(range(num_samples), size=10)
data['Price'][outlier_idx] = np.random.randint(800000, 1000000, size=10)
data['SqFt'][outlier_idx] = np.random.randint(4000, 6000, size=10)

# Create a DataFrame
df = pd.DataFrame(data)

# Export to CSV
df.to_csv("Home_Price.csv", index=False)

In [17]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt

In [19]:
df1=pd.read_csv("Home_Price.csv")
df1.head()

,Home,Price,SqFt,Bedrooms,Bathrooms,Offers,Brick,Neighborhood,Churn
0,Home 1,154903,3874,4,1,1,1,East,0
1,Home 2,672116,3574,5,2,4,1,West,1
2,Home 3,788230,1118,4,1,0,1,West,1
3,Home 4,794331,3878,4,2,1,1,East,1
4,Home 5,314954,3436,3,1,1,0,South,1

In [21]:
df=df1.drop(columns=['Churn'])

In [22]:
df.to_csv('Home_price.csv',index=False)

In [23]:
df1=pd.read_csv("Home_Price.csv")
df1.head()

     Home   Price  SqFt  Bedrooms  Bathrooms  Offers  Brick Neighborhood
0  Home 1  154903  3874         4          1       1      1         East
1  Home 2  672116  3574         5          2       4      1         West
2  Home 3  788230  1118         4          1       0      1         West
3  Home 4  794331  3878         4          2       1      1         East
4  Home 5  314954  3436         3          1       1      0        South

In [24]:
df1.shape

(200, 8)

In [25]:
df1["Neighborhood"]

0       East
1       West
2       West
3       East
4      South
       ...
195    North
196    North
197    South
198    North
199    South
Name: Neighborhood, Length: 200, dtype: object

In [26]:
df1["Neighborhood"].unique()

array(['East', 'West', 'South', 'North'], dtype=object)

In [27]:
df1["Neighborhood"].value_counts()

Neighborhood
North    58
East     52
West     50
South    40
Name: count, dtype: int64

In [28]:
df2=df1.drop(["Neighborhood","Bedrooms","Bathrooms","Offers"],axis='columns')
df2.shape
df2.isnull().sum()
df2.shape
df3=df2.dropna()
df3.isnull().sum()
df3.shape
df3["SqFt"].unique()

array([3874, 3574, 1118, 3878, 3436, 3044, 3765, 1978, 1196, 3288, 2543,
       3189, 1901, 1932, 1903, 2180, 2087, 3261, 1534, 3383, 1798, 2839,
       1890, 2802, 5891, 1850, 2076, 2330, 2283, 2276, 1616, 1977, 3595,
       3196, 2257, 3811, 2951, 3861, 2400, 1638, 3287, 2396, 1562, 3455,
       2727, 3285, 1499, 1463, 1473, 1790, 3500, 1866, 3295, 2518, 3186,
       1998, 1138, 3000, 1237, 2873, 2702, 3674, 1402, 1812, 3292, 1008,
       2313, 2006, 3622, 1836, 3482, 2990, 2927, 1886, 3647, 3974, 2166,
       3063, 2028, 4471, 3848, 3785, 1277, 2458, 3510, 1819, 1686, 1364,
       3996, 1416, 3396, 2943, 1600, 1633, 3626, 3041, 1550, 2566, 4992,
       3960, 2909, 1553, 1822, 1645, 2711, 2881, 1758, 3871, 3973, 3593,
       3897, 2693, 1527, 1786, 1105, 3444, 2379, 1485, 3796, 1511, 2030,
       2448, 1877, 1490, 1171, 1872, 2078, 3889, 2475, 1926, 1217, 1610,
       2143, 3864, 1927, 2021, 3835, 4941, 3971, 2899, 2284, 1242, 2278,
       1261, 1205, 1966, 1968, 3376, 1585, 1184, 1705, 3368, 1989, 3644,
       5984, 1478, 1947, 2907, 4232, 3251, 5767, 3896, 1991, 3731, 4931,
       3504, 3893, 3792, 3533, 1114, 3363, 2780, 2299, 2471, 3335, 3899,
       1276, 1957, 1844, 2569, 5739, 1748, 3342, 2366, 1584, 1173],
      dtype=int64)

In [29]:
df3['Budget']=df3["Price"].apply(lambda x:int(x.split(' ')[0]) if isinstance(x,str) else x)

In [31]:
df3.head

<bound method NDFrame.head of          Home   Price  SqFt  Brick  Budget
0      Home 1  154903  3874      1  154903
1      Home 2  672116  3574      1  672116
2      Home 3  788230  1118      1  788230
3      Home 4  794331  3878      1  794331
4      Home 5  314954  3436      0  314954
..        ...     ...   ...    ...     ...
195  Home 196  789255  1748      0  789255
196  Home 197  201563  3342      0  201563
197  Home 198  404860  2366      0  404860
198  Home 199  782738  1584      1  782738
199  Home 200  323174  1173      0  323174

[200 rows x 5 columns]>

In [32]:
df3[df3.Budget>100000]

         Home   Price  SqFt  Brick  Budget
0      Home 1  154903  3874      1  154903
1      Home 2  672116  3574      1  672116
2      Home 3  788230  1118      1  788230
3      Home 4  794331  3878      1  794331
4      Home 5  314954  3436      0  314954
..        ...     ...   ...    ...     ...
195  Home 196  789255  1748      0  789255
196  Home 197  201563  3342      0  201563
197  Home 198  404860  2366      0  404860
198  Home 199  782738  1584      1  782738
199  Home 200  323174  1173      0  323174

[200 rows x 5 columns]